{
  "longBio": "<strong>Benthos</strong> is an experimental progressive metal band from Milan, Italy. Known for their captivating fusion of progressive metal and mathcore with hints of nu jazz and electronic music, Benthos offer a sonic landscape where complexity and curiosity reign. Their sound is an ever-evolving journey of dynamic contrasts and boundary-pushing ideas.<br><br>Formed in 2018, the quintet first gained recognition in the Italian metal scene by opening for <em>The Contortionist</em> in 2019, quickly establishing themselves as an act to watch.<br><br>Benthos' debut album, <strong>II</strong>, was released on 23 April 2021, via American label <em>Eclipse Records</em>. The album is defined by its technical precision, intricate rhythms, and a balance of intense guitar work with serene melodic interludes. It was highly praised by the international progressive and metal communities, cementing their reputation as innovative newcomers.<br><br>The band’s hypnotic and high-energy live performances took centre stage during <strong>The Essence Tour</strong> in 2022, which saw them perform across Italy and Europe. In 2023, they reached new heights with a main stage performance at Milan’s renowned <strong>Dissonance Festival</strong>, sharing the bill with industry heavyweights Meshuggah, Soen, and Destrage. A high-definition recording of this performance is <a href=\"https://youtu.be/ue1BDz156Z4\">available on YouTube</a>.<br><br><strong>2024 marks a pivotal year for Benthos</strong>, as they join the roster of Sony’s <strong>Inside Out Music</strong>. Their upcoming album, <em><strong>From Nothing</strong></em>, scheduled for release on 25 April 2025, is a bold step forward for the band. This 12-track album, mixed by Federico Ascari and mastered by Tony Lindgren at <em>Fascination Street Studios</em>, explores an overarching theme through a kaleidoscope of aggressive, ethereal, chaotic, and jazzy elements, promising a deeply immersive listening experience.<br><br>The album’s first single, <em><strong>Fossil</strong></em>, was released on 12 November 2024, and provides an evocative glimpse into the album’s sonic and thematic vision. With more singles planned for release between January and March 2025, the band is building anticipation for what promises to be their most ambitious work yet.<br><br>With their boundary-pushing approach, Benthos continue to forge their identity in the progressive and metal landscape, offering a musical universe that invites fans to dive deep into its ever-evolving sound.",
  "shortBio": "<strong>Benthos</strong> is an experimental progressive metal band from Milan, Italy, known for their dynamic fusion of progressive metal, mathcore, and elements of nu jazz and electronic music. Their sound is an ever-evolving exploration of complexity, curiosity, and technical precision, offering a distinctive voice in the progressive metal landscape.<br><br>Formed in 2018, the band gained recognition after opening for <em>The Contortionist</em> in 2019, quickly establishing themselves as one of Italy’s most intriguing progressive acts. Their debut album, <em><strong>II</strong></em>, released in 2021, was praised for its intricate rhythms, powerful guitar work, and melodic interludes, earning acclaim within the international progressive music scene.<br><br>Benthos’ hypnotic and high-energy live performances took centre stage during <em><strong>The Essence Tour</strong></em> in 2022, with shows across Italy and Europe. In 2023, they further solidified their reputation with a main stage appearance at Milan’s renowned <em><strong>Dissonance Festival</strong></em>, sharing the bill with industry heavyweights Meshuggah, Soen, and Destrage.<br><br>Now signed to <em><strong>Inside Out Music</strong></em>, Benthos continues to push the boundaries of their sound, creating music that invites listeners to dive deep into their ever-evolving artistic vision.",
  "bandMembers": [
    {
      "name": "Gabriele Landillo",
      "instrument": "vocals"
    },
    {
      "name": "Gabriele Papagni",
      "instrument": "guitars"
    },
    {
      "name": "Enrico Tripodi",
      "instrument": "guitars"
    },
    {
      "name": "Alberto Fiorani",
      "instrument": "bass"
    },
    {
      "name": "Alessandro Tagliani",
      "instrument": "drums"
    }
  ],
  "contacts": {
    "email": "benthos.milano@gmail.com"
  },
  "ffoBands": [
    "The Contortionist",
    "Arcane Roots",
    "Between the Buried and Me",
    "Leprous",
    "Loathe",
    "Karnivool",
    "The Dillinger Escape Plan"
  ],
  "albumConcept": "<i>From Nothing</i> is a profound reflection on <b>the meaning of life</b> and the <b>legacy</b> humanity has forged throughout history. The album explores the positive and negative imprints left by humankind, and how they have shaped entire societies in various aspects – artistic, cultural, and social.<br><br>The title, <i>From Nothing</i>, encapsulates <b>the sudden realisation of an idea</b> and how it is capable of influencing the world around us, manifesting in both love and hate, discovery and regression. <b>Time</b> serves as a <b>crucial guide in the evolution of human existence</b>, with Benthos delving deep into how its passage impacts our achievements and failures.<br><br>Throughout the album, the band examines the intricate interplay between our <b>creations</b> and <b>destructions</b>, offering a nuanced commentary on humanity’s collective journey.<br><br><i>From Nothing</i> serves as a reminder of <b>the power of ideas to shape our environment</b> and the enduring legacy we leave behind in our ongoing quest for <b>meaning and understanding</b>.",
  "albumTrackList": [
    {
      "songTitle": "It Starts",
      "length": "01:10"
    },
    {
      "songTitle": "From Nothing",
      "length": "05:41"
    },
    {
      "songTitle": "Let Me Plunge",
      "length": "03:59"
    },
    {
      "songTitle": "As a Cordyceps",
      "length": "03:17"
    },
    {
      "songTitle": "Fossil",
      "length": "06:30"
    },
    {
      "songTitle": "Recompose",
      "length": "01:34"
    },
    {
      "songTitle": "The Giant Child",
      "length": "04:34"
    },
    {
      "songTitle": "Pure",
      "length": "04:45"
    },
    {
      "songTitle": "Athletic Worms",
      "length": "02:21"
    },
    {
      "songTitle": "Perpetual Drone Monkeys",
      "length": "04:55"
    },
    {
      "songTitle": "To Everything",
      "length": "04:44"
    },
    {
      "songTitle": "It Ends",
      "length": "01:53"
    }
  ],
  "pressQuotes": [
    {
      "quote": "We are delighted to welcome Benthos to the InsideOutMusic family. Their modern and daring approach to music caught our attention and we are looking forward to developing this young ambitious band!",
      "author": "Thomas Waber",
      "details": "label-head of InsideOutMusic",
      "link": ""
    },
    {
      "quote": "They are one of the true revelations of the day. The band [...] immediately displays exceptional talent, born from the remarkable skills of the musicians involved and an uncommon taste that seamlessly blends modern progressive metal with a decadent post-rock. They create a succession of rich and emotionally impactful sonic nuances. Benthos manage to destabilize and surprise the audience with rhythm and vocal changes in a highly original emotional crescendo. The unreleased songs they present hint at great things for the band’s future in the world of music recording.",
      "author": "Metal Hammer",
      "details": "Dissonance Festival 2023 Live Report",
      "link": "https://www-metalhammer-it.translate.goog/live-report/2023/06/11/dissonance-festival-2023-meshuggah-soen-destrage-more-circolo-magnolia-milano-3-giugno-2023/?_x_tr_sch=http&_x_tr_sl=it&_x_tr_tl=en&_x_tr_hl=it&_x_tr_pto=wapp"
    },
    {
      "quote": "The bar is set very high with this album. [...] These are probably such creative minds who walk around with a note and a pen in order to be able to write down all song ideas immediately.",
      "author": "Time For Metal",
      "details": "9.5/10",
      "link": "https://time-for-metal.eu/benthos-ii/"
    },
    {
      "quote": "I’ve found myself drawn back again and again to these tracks and am sure many of you will feel the same after you give it a go.",
      "author": "Metal Trenches",
      "details": "8.7/10",
      "link": "https://metaltrenches.com/reviews/benthos-ii-album-review-3079"
    },
    {
      "quote": "Benthos set an exclamation point in the international progressive metal scene with II. With a flawless sound, innovative ideas and familiar aspects, the Italians have proven that they can also compete on an international level.",
      "author": "MoreCore.De",
      "details": "8/10",
      "link": "https://www.morecore.de/review/benthos/ii/"
    },
    {
      "quote": "Exploring the outer fringes of musical convention and coming dangerously close to redefining the concept of progressive metal, a bold new player emerges from the Italian peninsula with a short yet gargantuan stylistic excursion of a debut.",
      "author": "Sonic Perspective",
      "details": "8.4/10",
      "link": "https://www.sonicperspectives.com/album-reviews/benthos-ii/"
    },
    {
      "quote": "Benthos represent a high-level band with great potential, certainly attentive to every little detail, as the album cover unmistakably testifies. It is not common to listen to a debut album of this caliber, and this represents an excellent starting point to appreciate an Italian band that has all the elements to continue impressing the listener.",
      "author": "True Metal",
      "details": "75/100",
      "link": "https://www-truemetal-it.translate.goog/recensioni/ii-14?_x_tr_sl=it&_x_tr_tl=en&_x_tr_hl=it&_x_tr_pto=wapp"
    },
    {
      "quote": "I was absolutely stricken when I discovered Benthos. [...] Benthos, if we’re all lucky enough, will have a proper chance to bloom into what could be one of the finest bands on the prog metal scene. [...] Honestly ’II’ basically fulfills the entire checklist for a record that’s not only very relistenable, fresh, and packed, but also highly promising.",
      "author": "Scene Point Blank",
      "details": "8.5/10",
      "link": "https://www.scenepointblank.com/reviews/benthos/ii/"
    },
    {
      "quote": "Curiosity, desire to experiment, deep admiration towards the founders of that genre of metal that goes from progressive to ambient and post rock: these are the ingredients that led to the birth of the debut album by the Milanese band Benthos. And they want to reiterate that they are original by naming the first album ’II’.",
      "author": "Metal Italia",
      "details": "7/10",
      "link": "https://metalitalia-com.translate.goog/album/benthos-ii/?_x_tr_sl=it&_x_tr_tl=en&_x_tr_hl=it&_x_tr_pto=wapp"
    }
  ]
}
