{
  "bio": "Benthos is an experimental progressive metal band from Milan, Italy. By combining geometric heavy riffs with vintage fuzzy tones and emotionally impactful sonic nuances, the result is a <b>unique universe of sound which you must hear to believe</b>.<br><br>After scoring a support gig as the opening act for <b>The Contortionist</b> at Milan's Circolo Svolta in 2019, the band garnered attention within the Italian music scene and has since been growing a dedicated fan base.<br><br>In 2021, American label <i>Eclipse Records</i> released the band's debut album, <b>\"II\"</b>, which impressed the metal and progressive community worldwide. The album has been promoted with a subsequent tour in 2022 across Italy, Germany, and Hungary.<br><br>Highlighting their trajectory, in 2023, Benthos marked the main stage of Milan's <b>Dissonance Festival</b>, sharing the bill with industry heavyweights like <b>Meshuggah</b>, <b>Soen</b>, <b>Destrage</b>, and <b>ten65</b>.<br><br>In June 2024, the band finished crafting their second full-length album, <i>\"From Nothing\"</i>. The band's sophomore release comprises 12 tracks that weave together a tapestry of diverse influences: from <b>aggressive</b> to <b>ethereal</b>, <b>chaotic</b> to <b>jazzy</b>, each composition explores a central theme from multifaceted angles. The album was mixed by <b>Federico Ascari</b> and mastered by <b>Tony Lindgren</b>, main mastering engineer at Jens Bogren's <b>Fascination Street Studios</b>.",
  "bandMembers": [
    {
      "name": "Gabriele Landillo",
      "instrument": "vocals"
    },
    {
      "name": "Gabriele Papagni",
      "instrument": "guitars"
    },
    {
      "name": "Enrico Tripodi",
      "instrument": "guitars"
    },
    {
      "name": "Alberto Fiorani",
      "instrument": "bass"
    },
    {
      "name": "Alessandro Tagliani",
      "instrument": "drums"
    }
  ],
  "contacts": {
    "email": "benthos.milano@gmail.com"
  },
  "ffoBands": [
    "The Contortionist",
    "Arcane Roots",
    "Between the Buried and Me",
    "22",
    "Leprous",
    "Loathe",
    "Karnivool"
  ],
  "albumConcept": "<i>From Nothing</i> is a profound reflection on <b>the meaning of life</b> and the <b>legacy</b> humanity has forged throughout history. The album explores the positive and negative imprints left by mankind, and how they have shaped entire societies in various aspects - artistic, cultural, and social.<br><br>The title, <i>From Nothing</i>, encapsulates <b>the sudden realization of an idea</b> and how it is capable of influencing the world around us, manifesting in both love and hate, discovery and regression. <b>Time</b> serves as a <b>crucial guide in the evolution of human existence</b>, with Benthos delving deep into how its passage impacts our achievements and failures.<br><br>Throughout the album, the band examines the intricate interplay between our <b>creations</b> and <b>destructions</b>, offering a nuanced commentary on humanity's collective journey.<br><br><i>From Nothing</i> serves as a reminder of <b>the power of ideas to shape our environment</b> and the enduring legacy we leave behind in our ongoing quest for <b>meaning and understanding</b>.",
  "pressQuotes": [
    {
      "quote": "They are one of the true revelations of the day. The band [...] immediately displays exceptional talent, born from the remarkable skills of the musicians involved and an uncommon taste that seamlessly blends modern progressive metal with a decadent post-rock. They create a succession of rich and emotionally impactful sonic nuances. Benthos manage to destabilize and surprise the audience with rhythm and vocal changes in a highly original emotional crescendo. The unreleased songs they present hint at great things for the band's future in the world of music recording.",
      "author": "Metal Hammer",
      "details": "Dissonance Festival 2023 Live Report",
      "link": "https://www-metalhammer-it.translate.goog/live-report/2023/06/11/dissonance-festival-2023-meshuggah-soen-destrage-more-circolo-magnolia-milano-3-giugno-2023/?_x_tr_sch=http&_x_tr_sl=it&_x_tr_tl=en&_x_tr_hl=it&_x_tr_pto=wapp"
    },
    {
      "quote": "The bar is set very high with this album. [...] These are probably such creative minds who walk around with a note and a pen in order to be able to write down all song ideas immediately.",
      "author": "Time For Metal",
      "details": "9.5/10",
      "link": "https://time-for-metal.eu/benthos-ii/"
    },
    {
      "quote": "I've found myself drawn back again and again to these tracks and am sure many of you will feel the same after you give it a go.",
      "author": "Metal Trenches",
      "details": "8.7/10",
      "link": "https://metaltrenches.com/reviews/benthos-ii-album-review-3079"
    },
    {
      "quote": "Benthos set an exclamation point in the international progressive metal scene with II. With a flawless sound, innovative ideas and familiar aspects, the Italians have proven that they can also compete on an international level.",
      "author": "MoreCore.De",
      "details": "8/10",
      "link": "https://www.morecore.de/review/benthos/ii/"
    },
    {
      "quote": "Exploring the outer fringes of musical convention and coming dangerously close to redefining the concept of progressive metal, a bold new player emerges from the Italian peninsula with a short yet gargantuan stylistic excursion of a debut.",
      "author": "Sonic Perspective",
      "details": "8.4/10",
      "link": "https://www.sonicperspectives.com/album-reviews/benthos-ii/"
    },
    {
      "quote": "Benthos represent a high-level band with great potential, certainly attentive to every little detail, as the album cover unmistakably testifies. It is not common to listen to a debut album of this caliber, and this represents an excellent starting point to appreciate an Italian band that has all the elements to continue impressing the listener.",
      "author": "True Metal",
      "details": "75/100",
      "link": "https://www-truemetal-it.translate.goog/recensioni/ii-14?_x_tr_sl=it&_x_tr_tl=en&_x_tr_hl=it&_x_tr_pto=wapp"
    },
    {
      "quote": "I was absolutely stricken when I discovered Benthos. [...] Benthos, if we're all lucky enough, will have a proper chance to bloom into what could be one of the finest bands on the prog metal scene. [...] Honestly 'II' basically fulfills the entire checklist for a record that's not only very relistenable, fresh, and packed, but also highly promising.",
      "author": "Scene Point Blank",
      "details": "8.5/10",
      "link": "https://www.scenepointblank.com/reviews/benthos/ii/"
    },
    {
      "quote": "Curiosity, desire to experiment, deep admiration towards the founders of that genre of metal that goes from progressive to ambient and post rock: these are the ingredients that led to the birth of the debut album by the Milanese band Benthos. And they want to reiterate that they are original by naming the first album 'II'.",
      "author": "Metal Italia",
      "details": "7/10",
      "link": "https://metalitalia-com.translate.goog/album/benthos-ii/?_x_tr_sl=it&_x_tr_tl=en&_x_tr_hl=it&_x_tr_pto=wapp"
    }
  ]
}
