{
  "longBio": "<strong>Benthos</strong> are an experimental progressive metal band from Milan, Italy. They bring a fresh, unique take to modern progressive metal, blending frenetic mathcore, jazzy, and electronic elements into their sound. With a sound that embraces complexity and curiosity, they craft a dynamic sonic landscape that continually evolves and pushes boundaries, shifting effortlessly between chaotic, technical passages and stunningly ethereal interludes.<br><br>Formed in 2018, the quintet quickly gained recognition in the Italian metal scene by opening for <i>The Contortionist</i> in 2019. Their debut album, <strong>II</strong>, released in 2021 via American label Eclipse Records, earned widespread acclaim for its technical precision, intricate rhythms, and balance of intense guitar work with serene melodic interludes. The album resonated deeply within the international progressive and metal communities, with some hailing it as one of the best debuts in modern progressive metal.<br><br>Benthos’ hypnotic live performances have cemented their reputation as a must-see act. Their 2022 <strong>Essence Tour</strong> took them across Italy and Europe, culminating in a standout main stage performance at Milan’s renowned <strong>Dissonance Festival</strong>, where they shared the stage with industry heavyweights Meshuggah, Soen, and Destrage. A high-definition recording of this performance is <a href=\"https://youtu.be/ue1BDz156Z4\" style='color: inherit'>available on YouTube</a>.<br><br><strong>2024 marked a major turning point for Benthos</strong> as they joined the roster of Sony’s <strong>Inside Out Music</strong>. Their sophomore album, <em><strong>From Nothing</strong></em>, is set for release on <strong>April 11, 2025</strong>. This ambitious 12-track record, mixed by Federico Ascari and mastered by Tony Lindgren at Fascination Street Studios, explores humanity’s positive and negative imprints on society over time.<br><br><em>From Nothing</em> includes the exploratory track “Fossil”, the first single released, which showcases the band’s distinctive, dynamic sound across its impressive six minutes. The album’s title track, “From Nothing”, is rooted in poetic lyrics that evoke the turbulent flow of existence - from the highs of ecstasy and the depths of pain to the profound beauty that connects them all. Lyrically, the album serves as a reminder of the power of ideas to shape our world and the legacy we leave in our search for meaning.<br><br>Across its 12 tracks, Benthos’ sound remains in constant evolution, marked by a refined dynamism and an unwavering pursuit of a unique musical language. With this boundary-pushing approach, Benthos continue to carve out their identity in the progressive metal landscape, inviting fans to dive deep into an ever-evolving sonic universe.",
  "shortBio": "<strong>Benthos</strong> are an experimental progressive metal band from Milan, Italy. They bring a fresh, unique take to modern progressive metal, blending frenetic mathcore, jazzy, and electronic elements into their sound. With a sound that embraces complexity and curiosity, they craft a dynamic sonic landscape that continually evolves and pushes boundaries, shifting effortlessly between chaotic, technical passages and stunningly ethereal interludes.<br><br>Formed in 2018, the quintet gained recognition after opening for The Contortionist in 2019. Their debut album, <em><strong>II</strong></em>, released in 2021, received widespread acclaim for its intricate rhythms, dynamic guitar work, and melodic interludes, establishing them as innovative newcomers in the international progressive music scene.<br><br>Benthos’ hypnotic live performances have cemented their reputation as a must-see act. Their 2022 <strong>Essence Tour</strong> saw them perform across Italy and Europe, and they further solidified their reputation with a main stage appearance at Milan’s <strong>Dissonance Festival</strong> in 2023, where they shared the stage with Meshuggah, Soen, and Destrage.<br><br>Now signed to <em><strong>Inside Out Music</strong></em>, Benthos continue to evolve their boundary-pushing sound, offering a unique and immersive musical experience with their sophomore album, set for release in 2025.",
  "bandMembers": [
    {
      "name": "Gabriele Landillo",
      "instrument": "vocals"
    },
    {
      "name": "Gabriele Papagni",
      "instrument": "guitars"
    },
    {
      "name": "Enrico Tripodi",
      "instrument": "guitars"
    },
    {
      "name": "Alberto Fiorani",
      "instrument": "bass"
    },
    {
      "name": "Alessandro Tagliani",
      "instrument": "drums"
    }
  ],
  "contacts": {
    "email": "benthos.milano@gmail.com"
  },
  "ffoBands": [
    "The Dillinger Escape Plan",
    "The Contortionist",
    "Karnivool",
    "Leprous",
    "Between the Buried and Me",
    "Arcane Roots"
  ],
  "albumConcept": "<i>From Nothing</i> is a profound reflection on <b>the meaning of life</b> and the <b>legacy</b> humanity has forged throughout history. The album explores the positive and negative imprints left by humankind, and how they have shaped entire societies in various aspects – artistic, cultural, and social.<br><br>The title, <i>From Nothing</i>, encapsulates <b>the sudden realisation of an idea</b> and how it is capable of influencing the world around us, manifesting in both love and hate, discovery and regression. <b>Time</b> serves as a <b>crucial guide in the evolution of human existence</b>, with Benthos delving deep into how its passage impacts our achievements and failures.<br><br>Throughout the album, the band examines the intricate interplay between our <b>creations</b> and <b>destructions</b>, offering a nuanced commentary on humanity’s collective journey.<br><br><i>From Nothing</i> serves as a reminder of <b>the power of ideas to shape our environment</b> and the enduring legacy we leave behind in our ongoing quest for <b>meaning and understanding</b>.",
  "albumTrackList": [
    {
      "songTitle": "It Starts",
      "length": "01:10"
    },
    {
      "songTitle": "From Nothing",
      "length": "05:41"
    },
    {
      "songTitle": "Let Me Plunge",
      "length": "03:59"
    },
    {
      "songTitle": "As a Cordyceps",
      "length": "03:17"
    },
    {
      "songTitle": "Fossil",
      "length": "06:30"
    },
    {
      "songTitle": "Recompose",
      "length": "01:34"
    },
    {
      "songTitle": "The Giant Child",
      "length": "04:34"
    },
    {
      "songTitle": "Pure",
      "length": "04:45"
    },
    {
      "songTitle": "Athletic Worms",
      "length": "02:21"
    },
    {
      "songTitle": "Perpetual Drone Monkeys",
      "length": "04:55"
    },
    {
      "songTitle": "To Everything",
      "length": "04:44"
    },
    {
      "songTitle": "It Ends",
      "length": "01:53"
    }
  ],
  "pressQuotes": [
    {
      "quote": "We are delighted to welcome Benthos to the InsideOutMusic family. Their modern and daring approach to music caught our attention and we are looking forward to developing this young ambitious band!",
      "author": "Thomas Waber",
      "details": "label-head of InsideOutMusic",
      "link": ""
    },
    {
      "quote": "They are one of the true revelations of the day. The band [...] immediately displays exceptional talent, born from the remarkable skills of the musicians involved and an uncommon taste that seamlessly blends modern progressive metal with a decadent post-rock. They create a succession of rich and emotionally impactful sonic nuances. Benthos manage to destabilize and surprise the audience with rhythm and vocal changes in a highly original emotional crescendo. The unreleased songs they present hint at great things for the band’s future in the world of music recording.",
      "author": "Metal Hammer",
      "details": "Dissonance Festival 2023 Live Report",
      "link": "https://www-metalhammer-it.translate.goog/live-report/2023/06/11/dissonance-festival-2023-meshuggah-soen-destrage-more-circolo-magnolia-milano-3-giugno-2023/?_x_tr_sch=http&_x_tr_sl=it&_x_tr_tl=en&_x_tr_hl=it&_x_tr_pto=wapp"
    },
    {
      "quote": "The bar is set very high with this album. [...] These are probably such creative minds who walk around with a note and a pen in order to be able to write down all song ideas immediately.",
      "author": "Time For Metal",
      "details": "9.5/10",
      "link": "https://time-for-metal.eu/benthos-ii/"
    },
    {
      "quote": "I’ve found myself drawn back again and again to these tracks and am sure many of you will feel the same after you give it a go.",
      "author": "Metal Trenches",
      "details": "8.7/10",
      "link": "https://metaltrenches.com/reviews/benthos-ii-album-review-3079"
    },
    {
      "quote": "Benthos set an exclamation point in the international progressive metal scene with II. With a flawless sound, innovative ideas and familiar aspects, the Italians have proven that they can also compete on an international level.",
      "author": "MoreCore.De",
      "details": "8/10",
      "link": "https://www.morecore.de/review/benthos/ii/"
    },
    {
      "quote": "Exploring the outer fringes of musical convention and coming dangerously close to redefining the concept of progressive metal, a bold new player emerges from the Italian peninsula with a short yet gargantuan stylistic excursion of a debut.",
      "author": "Sonic Perspective",
      "details": "8.4/10",
      "link": "https://www.sonicperspectives.com/album-reviews/benthos-ii/"
    },
    {
      "quote": "Benthos represent a high-level band with great potential, certainly attentive to every little detail, as the album cover unmistakably testifies. It is not common to listen to a debut album of this caliber, and this represents an excellent starting point to appreciate an Italian band that has all the elements to continue impressing the listener.",
      "author": "True Metal",
      "details": "75/100",
      "link": "https://www-truemetal-it.translate.goog/recensioni/ii-14?_x_tr_sl=it&_x_tr_tl=en&_x_tr_hl=it&_x_tr_pto=wapp"
    },
    {
      "quote": "I was absolutely stricken when I discovered Benthos. [...] Benthos, if we’re all lucky enough, will have a proper chance to bloom into what could be one of the finest bands on the prog metal scene. [...] Honestly ’II’ basically fulfills the entire checklist for a record that’s not only very relistenable, fresh, and packed, but also highly promising.",
      "author": "Scene Point Blank",
      "details": "8.5/10",
      "link": "https://www.scenepointblank.com/reviews/benthos/ii/"
    },
    {
      "quote": "Curiosity, desire to experiment, deep admiration towards the founders of that genre of metal that goes from progressive to ambient and post rock: these are the ingredients that led to the birth of the debut album by the Milanese band Benthos. And they want to reiterate that they are original by naming the first album ’II’.",
      "author": "Metal Italia",
      "details": "7/10",
      "link": "https://metalitalia-com.translate.goog/album/benthos-ii/?_x_tr_sl=it&_x_tr_tl=en&_x_tr_hl=it&_x_tr_pto=wapp"
    }
  ]
}
