{
  "bio": "Benthos is an experimental progressive metal band from Milan, Italy. By combining geometric heavy riffs with vintage fuzzy tones and emotionally impactful sonic nuances, the result is a <b>unique universe of sound which you must hear to believe</b>.<br><br>After scoring a support gig as the opening act for <i>The Contortionist</i> at Milan's Circolo Svolta in 2019, the band garnered attention within the Italian music scene and has since been growing a dedicated fan base.<br><br>In 2021, American label <i>Eclipse Records</i> released the band's debut album, <b>\"II\"</b>, which impressed the metal and progressive community worldwide. The album has been promoted with a subsequent tour in 2022 across Italy, Germany, and Hungary.<br><br>Highlighting their trajectory, in 2023, Benthos marked the main stage of Milan's <b>Dissonance Festival</b>, sharing the bill with industry heavyweights like Meshuggah, Soen, Destrage, and ten65.<br><br>Currently, the band is crafting their second full-length album, <i>\"From Nothing\"</i>. The band's sophomore release comprises 12 tracks that weave together a tapestry of diverse influences: from <b>aggressive</b> to <b>ethereal</b>, <b>chaotic</b> to <b>jazzy</b>, each composition explores a central theme from multifaceted angles. The album is being produced by mixing engineer <b>Federico Ascari</b> and mastered by <b>Tony Lindgren</b>, main mastering engineer at Jens Bogren's Fascination Street Studios who is renowned for his work with Opeth, Between the Buried and Me, Sepultura, Enslaved, Leprous, and many more.",
  "bandMembers": [
    {
      "name": "Gabriele Landillo",
      "instrument": "vocals"
    },
    {
      "name": "Gabriele Papagni",
      "instrument": "guitars"
    },
    {
      "name": "Enrico Tripodi",
      "instrument": "guitars"
    },
    {
      "name": "Alberto Fiorani",
      "instrument": "bass"
    },
    {
      "name": "Alessandro Tagliani",
      "instrument": "drums"
    }
  ],
  "contacts": {
    "email": "benthos.milano@gmail.com",
    "address": "Gabriele Papagni\nPiazza San Matteo, 17\n20093 Cologno Monzese (MI)\nItaly"
  }
}
